<?php 
//================================================
$key='';
//================================================
error_reporting(0);
session_start();
$_SESSION['gmbt'] ='雷霆H5';
//=========================================
$db_host='127.0.0.1';
$db_username='root';//数据库帐号
$db_password='123456';//数据库密码
$dbport = 3306;
//===============游戏分区=================================
$qu  = trim($_POST['qu']);
if($_POST['qu']==1){
	$dbgame='actor_s1';	//一区角色数据库
}elseif($_POST['qu']==2){
	$dbgame='actor_s2';	//二区角色数据库
}
elseif($_POST['qu']==3){
	$dbgame='actor_s3';	//三区角色数据库
}
elseif($_POST['qu']==4){
	$dbgame='actor_s4';	//四区角色数据库
}
elseif($_POST['qu']==5){
	$dbgame='actor_s5';	//四区角色数据库
}
elseif($_POST['qu']==6){
	$dbgame='actor_s6';	//四区角色数据库
}			
//=========================================================
$admin='admin'; 	//首次登陆账号，建议不要使用admin
$adminpass='123456';  //首次登陆密码	
$gmdb = "Yzf_gmht";	//后台数据库名称
//=========================================================
// 可修改玩家的后台
$max = 999999999;  //邮件物品最大数量
$title = 'GM邮件';     //邮件标题
$content = 'GM邮件已发送';   //邮件内容
$month = $_POST['month'];
if($month=='1'){
	$card=280000;	 //月卡
}
elseif($month=='2'){
	$card=880000;    //终生卡
}

$yzfqu=array(
		'1'=>'一区',   //自行修改多区
		'2'=>'二区',
		'3'=>'三区',
		'4'=>'四区',
                  '5'=>'五区',
                  '6'=>'六区',

	);
$yzfhuobi=array(
		''=>'物品',   //自行修改玩家能发的
	//	'0'=>'经验',    不发经验
		'1'=>'金币',
		'2'=>'元宝',
		'3'=>'声望',
		'4'=>'精练石',
		'5'=>'工会贡献',
		'6'=>'工会资金',
		'7'=>'功勋',
		'8'=>'成就',
		'9'=>'战纹精华',
		'10'=>'战纹碎片',
		'11'=>'低级符文精华',
		'12'=>'高级符文精华',
		'13'=>'神兵经验',
		'14'=>'威望',
		'15'=>'筹码',
		'16'=>'兽神精魂',
	);
//=========================================================
//  网站最下面版权信息修改。
$_SESSION['copyright']='';   
//=========================================================	
	$user_IP = ($_SERVER["HTTP_VIA"]) ? $_SERVER["HTTP_X_FORWARDED_FOR"] : $_SERVER["REMOTE_ADDR"];
	$user_IP = ($user_IP) ? $user_IP : $_SERVER["REMOTE_ADDR"];
	$now = date('Y-m-d H:i:s',strtotime('now')); 
?>